import { CharacterMessages } from '../types'

export const tanukichi: CharacterMessages = {
  'odai-start': [
    '今回のお題はこれだなも！ たくさん回答するだなも！',
    '今回のお題はこれだなも！ 回答お待ちしているだなも！',
    '大喜利スタートだなも！',
  ],
  'odai-inspire-001': ['みんなおはようだなも！'],
  'odai-inspire-002': ['今週もお仕事頑張るだなも！', '調子はいかがだなもか？'],
  'odai-inspire-003': [
    '新しいお題、待ってるだなも！',
    '次はどんなお題か楽しみだなも！',
    'お題がなくてさびしいだなも...',
  ],
  'kotae-status': [
    'お疲れさまだなも！ ただいまの回答状況をお伝えするだなも！',
    '今はこんな感じだなも！',
    'まだまだ回答待ってるだなも！',
    'みんな元気だなもか？',
  ],
  'vote-start': ['みんなー、投票が始まるだなも！'],
  'vote-description': ['回答の右のボタンを押すと投票できるだなも！'],
  'vote-status': [
    'お疲れさまだなも！ ただいまの投票状況をお伝えするだなも！',
    '今はこんな感じだなも！',
    'みんな投票してくれだなも！',
    'ぼくはあの回答がお気に入りだなも！',
  ],
  'vote-result-001': ['このような結果になっただなも！ 入賞者のみんなおめでとうだなも！ :clap:'],
  'vote-result-002': ['次回も奮って参加してほしいだなも！ :raised_hands:'],
  'vote-result-003': [
    '個人の結果は `/oogiri-check-my-result` で確認できるだなも！ (他の人には見えないだなも:ok_man:)',
  ],
  'ippon-odai-start': ['IPPON グランプリスタートだなも！ たくさん回答するだなも！'],
}
